Table of Contents
 Class CombiInputEC
Namespace
IdeaRS.OpenModel.Loading
Assembly
IdeaRS.OpenModel.dll
Combination according to EC in the model
[OpenModelClass("CI.StructModel.Loading.CombiInputEC,CI.Loading", "CI.StructModel.Loading.ICombiInput,CI.BasicTypes", typeof(CombiInput))]
public class CombiInputEC : CombiInput
Inheritance
object
OpenObject
OpenElementId
CombiInput
CombiInputEC
Inherited Members
 CombiInput.Name
 CombiInput.Items
 CombiInput.Description
 OpenElementId.Id
 object.Equals(object)
 object.Equals(object, object)
 object.GetHashCode()
 object.GetType()
 object.MemberwiseClone()
 object.ReferenceEquals(object, object)
 object.ToString()
Constructors
 CombiInputEC()
Constructor
public CombiInputEC()
Properties
 TypeCalculationCombi
Type of combination
[OpenModelProperty("TypeLinear_Envelope")]
public TypeCalculationCombiEC TypeCalculationCombi { get; set; }
Property Value
TypeCalculationCombiEC
 TypeCombiEC
Type of EC combination
public TypeOfCombiEC TypeCombiEC { get; set; }
Property Value
TypeOfCombiEC
 Edit this page